backend: !!python/unicode 'tensorflow'
class_name: Sequential
config:
- class_name: Conv1D
  config:
    activation: relu
    activity_regularizer: null
    batch_input_shape: !!python/tuple [null, 101, 5]
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: !!python/tuple [1]
    dtype: float32
    filters: 1024
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [8]
    name: conv1
    padding: valid
    strides: !!python/tuple [1]
    trainable: true
    use_bias: true
- class_name: MaxPooling1D
  config:
    name: downsample1
    padding: valid
    pool_size: !!python/tuple [1]
    strides: !!python/tuple [1]
    trainable: true
- class_name: Conv1D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: !!python/tuple [1]
    filters: 64
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [5]
    name: conv2
    padding: valid
    strides: !!python/tuple [1]
    trainable: true
    use_bias: true
- class_name: MaxPooling1D
  config:
    name: downsample2
    padding: valid
    pool_size: !!python/tuple [1]
    strides: !!python/tuple [1]
    trainable: true
- class_name: Dropout
  config: {name: dropout1, noise_shape: null, rate: 0.3, seed: null, trainable: true}
- class_name: Conv1D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: !!python/tuple [1]
    filters: 64
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [5]
    name: conv3
    padding: valid
    strides: !!python/tuple [1]
    trainable: true
    use_bias: true
- class_name: Conv1D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: !!python/tuple [1]
    filters: 64
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3]
    name: conv4
    padding: valid
    strides: !!python/tuple [1]
    trainable: true
    use_bias: true
- class_name: MaxPooling1D
  config:
    name: downsample3
    padding: valid
    pool_size: !!python/tuple [1]
    strides: !!python/tuple [1]
    trainable: true
- class_name: Flatten
  config: {data_format: channels_last, name: flatten1, trainable: true}
- class_name: Dropout
  config: {name: dropout2, noise_shape: null, rate: 0.3, seed: null, trainable: true}
- class_name: Dense
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    name: dense_13
    trainable: true
    units: 64
    use_bias: true
- class_name: Dropout
  config: {name: dropout3, noise_shape: null, rate: 0.3, seed: null, trainable: true}
- class_name: Dense
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    name: dense_14
    trainable: true
    units: 64
    use_bias: true
- class_name: Dropout
  config: {name: dropout4, noise_shape: null, rate: 0.3, seed: null, trainable: true}
- class_name: Dense
  config:
    activation: linear
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    name: dense_15
    trainable: true
    units: 1
    use_bias: true
keras_version: 2.2.2

