backend: !!python/unicode 'tensorflow'
class_name: Model
config:
  input_layers:
  - [main_input, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 101, 8]
      dtype: float32
      name: main_input
      sparse: false
    inbound_nodes: []
    name: main_input
  - class_name: Conv1D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1]
      filters: 100
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [11]
      name: conv1
      padding: valid
      strides: !!python/tuple [1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - main_input
        - 0
        - 0
        - {}
    name: conv1
  - class_name: Conv1D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1]
      filters: 75
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [11]
      name: conv2
      padding: valid
      strides: !!python/tuple [1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv1
        - 0
        - 0
        - {}
    name: conv2
  - class_name: Conv1D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1]
      filters: 50
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [11]
      name: conv3
      padding: valid
      strides: !!python/tuple [1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2
        - 0
        - 0
        - {}
    name: conv3
  - class_name: GlobalAveragePooling1D
    config: {name: global_average_pooling1d_13, trainable: true}
    inbound_nodes:
    - - - conv3
        - 0
        - 0
        - {}
    name: global_average_pooling1d_13
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_27
      trainable: true
      units: 50
      use_bias: true
    inbound_nodes:
    - - - global_average_pooling1d_13
        - 0
        - 0
        - {}
    name: dense_27
  - class_name: Dropout
    config: {name: dropout1, noise_shape: null, rate: 0.5, seed: null, trainable: true}
    inbound_nodes:
    - - - dense_27
        - 0
        - 0
        - {}
    name: dropout1
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_28
      trainable: true
      units: 30
      use_bias: true
    inbound_nodes:
    - - - dropout1
        - 0
        - 0
        - {}
    name: dense_28
  - class_name: Dropout
    config: {name: dropout2, noise_shape: null, rate: 0.5, seed: null, trainable: true}
    inbound_nodes:
    - - - dense_28
        - 0
        - 0
        - {}
    name: dropout2
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_29
      trainable: true
      units: 10
      use_bias: true
    inbound_nodes:
    - - - dropout2
        - 0
        - 0
        - {}
    name: dense_29
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_30
      trainable: true
      units: 5
      use_bias: true
    inbound_nodes:
    - - - dense_29
        - 0
        - 0
        - {}
    name: dense_30
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_32
      trainable: true
      units: 5
      use_bias: true
    inbound_nodes:
    - - - dense_29
        - 0
        - 0
        - {}
    name: dense_32
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_31
      trainable: true
      units: 1
      use_bias: true
    inbound_nodes:
    - - - dense_30
        - 0
        - 0
        - {}
    name: dense_31
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_33
      trainable: true
      units: 1
      use_bias: true
    inbound_nodes:
    - - - dense_32
        - 0
        - 0
        - {}
    name: dense_33
  - class_name: Activation
    config: {activation: sigmoid, name: is_edited, trainable: true}
    inbound_nodes:
    - - - dense_31
        - 0
        - 0
        - {}
    name: is_edited
  - class_name: Activation
    config: {activation: linear, name: edit_rate, trainable: true}
    inbound_nodes:
    - - - dense_33
        - 0
        - 0
        - {}
    name: edit_rate
  name: model_5
  output_layers:
  - [is_edited, 0, 0]
  - [edit_rate, 0, 0]
keras_version: 2.2.2

