backend: !!python/unicode 'tensorflow'
class_name: Sequential
config:
- class_name: Conv1D
  config:
    activation: relu
    activity_regularizer: null
    batch_input_shape: !!python/tuple [null, 101, 5]
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: !!python/tuple [1]
    dtype: float32
    filters: 50
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [11]
    name: conv1
    padding: valid
    strides: !!python/tuple [1]
    trainable: true
    use_bias: true
- class_name: Conv1D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: !!python/tuple [1]
    filters: 50
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [11]
    name: conv2
    padding: valid
    strides: !!python/tuple [1]
    trainable: true
    use_bias: true
- class_name: GlobalAveragePooling1D
  config: {name: global_average_pooling1d_20, trainable: true}
- class_name: Dense
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    name: dense_95
    trainable: true
    units: 50
    use_bias: true
- class_name: Dropout
  config: {name: dropout1, noise_shape: null, rate: 0.5, seed: null, trainable: true}
- class_name: Dense
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    name: dense_96
    trainable: true
    units: 3
    use_bias: true
- class_name: Dense
  config:
    activation: linear
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    name: dense_97
    trainable: true
    units: 1
    use_bias: true
- class_name: Activation
  config: {activation: sigmoid, name: activation_4, trainable: true}
keras_version: 2.2.2

